Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This function can be used to set a given cell within the given DS grid to any value, which can be a real number or a string.
zh_cn: 此函数可用于将给定DS网格中的给定单元格设置为任何值，可以是实数或字符串。

source: This function can be used to set a given set of tile-data to be an empty tile.
zh_cn: 此函数可用于将一组给定的图块数据设置为空图块。

source: This function can be used to set a given set of tile-data to flip the tile or not.
zh_cn: 此函数可用于设置给定的一组图块数据是否翻转图块。

source: This function can be used to set a given set of tile-data to mirror the tile or not.
zh_cn: 此函数可用于设置给定的一组瓷砖数据以镜像瓷砖或不镜像瓷砖。

source: This function can be used to set a given set of tile-data to rotate the tile 90 degrees or not.
zh_cn: 此函数可用于设置给定的一组图块数据，以将图块旋转90度或不旋转。

source: This function can be used to set a local notification to be shown on a given date at a given time.
zh_cn: 此函数可用于设置在给定日期、给定时间显示的本地通知。

source: This function can be used to set a maximum window height for your game.
zh_cn: 此函数可以用来为你的游戏设置最大窗口高度。

source: This function can be used to set a maximum window width for your game.
zh_cn: 此函数可以用来设置游戏的最大窗口宽度。

source: This function can be used to set a minimum window height for your game.
zh_cn: 此函数可以用来为你的游戏设置最小窗口高度。

source: This function can be used to set a minimum window width for your game.
zh_cn: 此函数可以用来为你的游戏设置一个最小的窗口宽度。

source: This function can be used to set a particle type to use a custom sprite from the game assets.
zh_cn: 此函数可用于设置粒子类型，以使用游戏资源中的自定义精灵。

source: This function can be used to set a previously added list entry.
zh_cn: 此函数可用于设置先前添加的列表条目。

source: This function can be used to set a rectangular region of a given grid to a specified value (which can be either a real or a string) as illustrated by the image shown below:
zh_cn: 此函数可用于将给定网格的矩形区域设置为指定值(可以是实数或字符串)，如下图所示:

source: This function can be used to set a script function that will be called at the beginning of every game frame that the camera is assigned to a visible and active view port.
zh_cn: 此函数可用于设置一个脚本函数，此函数将在相机被分配到可见且活动的视口的每个游戏帧开始时被调用。

source: This function can be used to set a script function that will be called at the end of every game frame that the camera is assigned to a visible and active view port, after everything for that view camera has been rendered.
zh_cn: 此函数可用于设置一个脚本函数，此函数将在相机被分配到一个可见且活动的视口的每个游戏帧结束时调用，在该视口的所有内容都已被渲染之后。

source: This function can be used to set a script function that will be called every game frame that the camera is assigned to a visible and active view port.
zh_cn: 此函数可用于设置一个脚本函数，该脚本函数将被调用每一个游戏帧，相机被分配到一个可见和活动的视图端口。

source: This function can be used to set a three alpha (transparency) value gradient for each particle created of the given type.
zh_cn: 此函数可用于为给定类型的每个粒子设置3 alpha(透明度)值梯度。

source: This function can be used to set a three colour gradient for each particle created of the given type.
zh_cn: 此函数可用于为给定类型的每个粒子设置三种颜色的渐变。

source: This function can be used to set a two colour gradient for each particle created of the given type.
zh_cn: 此函数可用于为给定类型的每个粒子设置两种颜色的渐变。

source: This function can be used to set an alarm.
zh_cn: 此函数可以设置告警。

source: This function can be used to set an alpha value (transparency) gradient for each particle created of the given type.
zh_cn: 此函数可用于为给定类型的每个粒子设置alpha值(透明度)渐变。

source: This function can be used to set any cell (grid square) within the tile map element on the layer to a new tile.
zh_cn: 此函数可以用来将图层上的贴图元素中的任何单元格(网格方格)设置为一个新的贴图。

source: This function can be used to set any of the available gamepad options.
zh_cn: 此函数可以用来设置任何可用的游戏手柄选项。

source: This function can be used to set custom mass and inertia values for a physics enabled instance.
zh_cn: 此函数可用于为启用物理的实例设置自定义质量和惯性值。

source: This function can be used to set the "dead zone" of the joystick axis.
zh_cn: 此函数可用于设置操纵杆轴的"死区"。

source: This function can be used to set the anti-aliasing (AA) level for SWF format vector sprites.
zh_cn: 此函数可用于设置 SWF 格式矢量精灵的抗锯齿 (AA) 级别。

source: This function can be used to set the backface culling mode.
zh_cn: 此函数可用于设置背面剔除模式。

source: This function can be used to set the base animation speed and type as for the sprite resource.
zh_cn: 此函数可以用来为精灵资源设置基本动画速度和类型。

source: This function can be used to set the bounding box mode for a sprite.
zh_cn: 此函数可以用来设置精灵的边界框模式。

source: This function can be used to set the bounding box values for a sprite.
zh_cn: 此函数可以用来设置精灵的边界框值。

source: This function can be used to set the colour of the LEDs within a PlayStation controller.
zh_cn: 此函数可用于设置PlayStation控制器中led的颜色。

source: This function can be used to set the current threshold setting of the analogue buttons for a given device.
zh_cn: 此函数可用于设置给定设备模拟按钮的当前阈值设置。

source: This function can be used to set the default camera to use a custom camera that you have previously created using one of the camera_create() functions.
zh_cn: 此函数可用于设置默认相机，以使用您之前使用camera_create()函数之一创建的自定义相机。

source: This function can be used to set the device to detect a double tap of the mb_left (left mouse button) as an mb_right (right mouse button) tap or not.
zh_cn: 此函数可用于设置设备检测双击mb_left(鼠标左键)为mb_right(鼠标右键)的轻按或不轻按。

source: This function can be used to set the game speed.
zh_cn: 此函数可以用来设置游戏速度。

source: This function can be used to set the gamepad mapping on those targets that permit it.
zh_cn: 此函数可用于在允许的目标上设置手柄映射。

source: This function can be used to set the height of the given view port.
zh_cn: 此函数可以用来设置给定视图端口的高度。

source: This function can be used to set the image index of a sprite asset which has multiple sub-images on a layer.
zh_cn: 此函数可用于设置sprite资源的图像索引，该资源在一个层上有多个子图像。

source: This function can be used to set the image index of the background sprite which has multiple sub-images.
zh_cn: 此函数可以用来设置有多个子图像的背景精灵的图像索引。

source: This function can be used to set the kind of path that you wish the specified resource to be.
zh_cn: 此函数可用于设置您希望指定资源的路径类型。

source: This function can be used to set the linear interpolation for a single sampler "slot" when using Shaders in GameMaker.
zh_cn: 当在GameMaker中使用着色器时，此函数可以用来设置单个采样器"槽"的线性插值。

source: This function can be used to set the scale along the x-axis of a background element.
zh_cn: 此函数可以用来设置背景元素x轴上的比例。

source: This function can be used to set the scale along the y-axis of a background element.
zh_cn: 此函数可用于设置背景元素沿y轴的比例。

source: This function can be used to set the sleep margin value used for the render timing of your game, and requires a millisecond value.
zh_cn: 此函数可以用来设置游戏渲染时间的睡眠余量值，需要一个毫秒值。

source: This function can be used to set the speed of an animating image that has been assigned to a sprite element.
zh_cn: 此函数可用于设置已分配给sprite元素的动画图像的速度。

source: This function can be used to set the speed of an animating sprite that has been assigned to a background element.
zh_cn: 此函数可以用来设置已经分配给背景元素的动画精灵的速度。

source: This function can be used to set the texture filtering (linear interpolation) of all images drawn on the game screen.
zh_cn: 此函数可以用来设置游戏屏幕上绘制的所有图像的纹理过滤(线性插值)。

source: This function can be used to set the the bit-mask for a sound so that it will play only from those listeners specified.
zh_cn: 此函数可用于设置声音的位掩码，以便只从特定侦听器那里播放。

source: This function can be used to set the the bit-mask for an emitter so that all sounds played through the emitter will play only from those listeners specified.
zh_cn: 此函数可用于设置发射器的位掩码，以便通过发射器播放的所有声音仅从指定的收听者处播放。

source: This function can be used to set the tile bit mask for a all tile maps in the game.
zh_cn: 此函数可用于设置游戏中所有tile maps的tile位掩码。

source: This function can be used to set the tile bit mask for a single tile map.
zh_cn: 此函数可用于设置单个图块地图的图块位掩码。

source: This function can be used to set the tile index (the position of the tile within the tile set image) for a set of tile-data.
zh_cn: 此函数可用于为一组图块数据设置图块索引(图块在图块集图像中的位置)。

source: This function can be used to set the timing method to be used for rendering your game.
zh_cn: 此函数可以用来设置渲染游戏的计时方法。

source: This function can be used to set the visibility of the given view port.
zh_cn: 此函数可用于设置给定视图端口的可见性。

source: This function can be used to set the width of the given view port.
zh_cn: 此函数可以用来设置给定视图端口的宽度。

source: This function can be used to set the x and y origin of a sprite, and takes relative values based on the (0,0) position being the upper left corner of the sprite.
zh_cn: 此函数可用于设置精灵的x和y原点，并基于精灵左上角的(0，0)位置获取相对值。

source: This function can be used to set the x position of the given view port.
zh_cn: 此函数可以用来设置给定视图端口的x位置。

source: This function can be used to set the y position of the given view port.
zh_cn: 此函数可以用来设置给定视图端口的y位置。

source: This function can be used to set the z-buffer testing comparison mode (see gpu_set_ztestenable() for more information).
zh_cn: 此函数可用于设置z-buffer测试比较模式(有关更多信息，请参阅gpu_set_ztestenable())。

source: This function can be used to set whether a single sampler "slot" repeats the given texture when using Shaders in GameMaker .
zh_cn: 此函数可用于设置在GameMaker中使用着色器时，单个采样器"槽"是否重复给定的纹理。

source: This function can be used to show or hide the system UI on Android only.
zh_cn: 此函数只能用于显示或隐藏Android上的系统UI。

source: This function can be used to show the virtual keyboard on the device running the game.
zh_cn: 此函数可用于在运行游戏的设备上显示虚拟键盘。

source: This function can be used to sort a DS grid based on the values from a given column (much as you would sort files by date, size etc... in the OS file explorer).
zh_cn: 此函数可以用来根据给定列中的值对DS网格进行排序(就像根据日期、大小等对文件进行排序一样)...在OS文件资源管理器中)。

source: This function can be used to switch a particle system from its current layer to a new one.
zh_cn: 此函数可以用来将粒子系统从当前层切换到新层。

source: This function can be used to switch off the drawing of a particle system so that any updates done to the system (automatic or otherwise) will not be seen.
zh_cn: 此函数可用于关闭粒子系统的绘制，这样对系统所做的任何更新（自动或其他）都不会被看到。

source: This function can be used to switch on and off the standard debug overlay when testing your game and is disabled by default.
zh_cn: 此函数可以用来在测试你的游戏时打开和关闭标准的调试覆盖，默认情况下是禁用的。

source: This function can be used to toggle alpha-blending on and off.
zh_cn: 此函数可以用来打开和关闭alpha混合。

source: This function can be used to toggle on (true) and off (false) depth ordering using the z-buffer.
zh_cn: 此函数可用于使用z-buffer切换深度排序(true)和关闭(false)。

source: This function can be used to toggle z-buffer testing on or off, affecting how things will be drawn (in general only of use when working with 3D projects).
zh_cn: 此函数可以用来打开或关闭z-buffer测试，影响物体的绘制方式(通常只在处理3D项目时使用)。

source: This function can be used to turn a given string into a real number.
zh_cn: 此函数可以用来把一个给定的字符串变成一个实数。

source: This function can be used to write data to a previously created buffer.
zh_cn: 此函数可用于将数据写入先前创建的缓冲区。

source: This function can give some beautiful particle effects but may not always be necessary.
zh_cn: 此函数可以提供一些漂亮的粒子效果，但并不总是必要的。

source: This function can set the background colour of the game window.
zh_cn: 此函数可以设置游戏窗口的背景颜色。

source: This function cancels the given push notification.
zh_cn: 此函数取消给定的推送通知。

source: This function changes the actual path asset, and so will permanently affect how the path is used by all instances in the game from the moment the function is used until the end of the game.
zh_cn: 此函数改变了实际的路径资源，因此将永久地影响游戏中所有实例从使用此函数的时刻到游戏结束时使用该路径的方式。

source: This function changes the actual path asset, and so will permanently affect how the path is used by all instances in the game from the moment the function is used until the end of the game.If this is not what you require, then you should use a function like path_duplicate() to create a copy of the path first, then call this function on the duplicated asset (don't forget to call path_delete() on the asset when it is no longer required).
zh_cn: 此函数改变了实际的路径资源，因此将永久地影响游戏中所有实例如何使用路径，从函数被使用的时刻直到游戏结束。如果这不是您所需要的，那么您应该首先使用一个类似path_duplicate()的函数来创建路径的副本，然后在复制的资源上调用此函数(不要忘记在不再需要它时在资源上调用path_delete())。

source: This function changes the actual path asset, and so will permanently affect how the path is used by all instances in the game from the moment the function is used until the end of the game. If this is not what you require, then you should use a function like path_duplicate() to create a copy of the path first, then call this function on the duplicated asset (don't forget to call path_delete() on the asset when it is no longer required).
zh_cn: 此函数会改变实际的路径资源，因此会永久地影响游戏中所有实例使用路径的方式(从函数被使用到游戏结束)。如果这不是您所需要的，那么您应该首先使用像path_duplicate()这样的函数来创建路径的副本，然后在复制的资源上调用此函数(不要忘记在不再需要资源时调用path_delete())。

source: This function changes the actual path resource, and so will permanently affect how the path is used by all instances in the game from the moment the function is used until the end of the game.
zh_cn: 此函数会改变实际的路径资源，因此会永久地影响游戏中所有实例使用路径的方式(从函数被使用到游戏结束)。

source: This function changes the actual path resource, and so will permanently affect how the path is used by all instances in the game from the moment the function is used until the end of the game.If this is not what you require, then you should use a function like path_duplicate() to create a copy of the path first, then call this function on the duplicated asset (don't forget to call path_delete() on the asset when it is no longer required).
zh_cn: 此函数改变了实际的路径资源，因此将永久地影响游戏中所有实例使用路径的方式，从函数被使用的时刻开始，直到游戏结束。如果这不是您所需要的，那么您应该首先使用一个类似path_duplicate()的函数来创建路径的副本，然后在复制的资源上调用此函数(不要忘记在不再需要它时在资源上调用path_delete())。

source: This function checks if a custom attachment has been created using the skeleton_attachment_create() or skeleton_attachment_replace() functions.
zh_cn: 此函数检查是否已经使用skeleton_attachment_create()或skeleton_attachment_replace()函数创建了自定义附件。

source: This function checks if the game was started via an invite to a GXC game and if so joins it.
zh_cn: 此函数检查游戏是否是通过GXC游戏的邀请开始的，如果是，就加入游戏。

source: This function checks if the supplied value is a struct.
zh_cn: 此函数检查所提供的值是否为结构。

source: This function checks to see if a key exists in the currently open ini and will return true if it does or false otherwise.
zh_cn: 此函数检查当前打开的ini中是否存在一个键，如果存在，将返回true，否则返回false。

source: This function checks to see if a section exists in the currently open ini and will return true if it does or false otherwise.
zh_cn: 此函数检查当前打开的 ini 中是否存在某个节，如果存在则返回 true，否则返回 false。

source: This function checks to see if the automatic depth buffer generation for surfaces is enabled.
zh_cn: 此函数检查是否启用了表面的自动深度缓冲生成。

source: This function clears the matrix stack.
zh_cn: 此函数清除矩阵堆栈。

source: This function combines the function draw_sprite_ext() with the function draw_sprite_part(), adding in some additional blending options so that each corner of the final sprite part can be blended with an individual colour.
zh_cn: 此函数将函数 draw_sprite_ext() 与函数 draw_sprite_part() 结合在一起，添加了一些额外的混合选项，以便最终精灵部分的每个角都可以与单独的颜色混合。

source: This function combines the function draw_surface_ext() with the function draw_surface_part(), adding in some additional blending options so that each corner of the final surface part can be blended with an individual colour.
zh_cn: 此函数将函数 draw_surface_ext() 与函数 draw_surface_part() 结合在一起，添加了一些额外的混合选项，以便最终表面部分的每个角都可以与单独的颜色混合。

source: This function computes a path for the instance from its current position and orientation to the position specified by the xgoal, ygoal arguments.
zh_cn: 此函数计算实例从其当前位置和方向到xgoal、ygoal参数指定位置的路径。

source: This function computes a path for the instance from its current position and orientation to the position specified by the xgoal,ygoal arguments.
zh_cn: 此函数计算实例从其当前位置和方向到xgoal、ygoal参数指定位置的路径。

source: This function computes a straight line path from the current instance position to the point specified by the "xgoal" and "ygoal" values.
zh_cn: 此函数计算从当前实例位置到由"xgoal"和"ygoal"值指定的点的直线路径。

source: This function concatenates a range of elements in an array, non-string values will be converted to string.
zh_cn: 此函数连接数组中的一系列元素，非字符串值将被转换为字符串。

source: This function concatenates a set of arguments, non-string values will be converted to string.
zh_cn: 此函数连接一组参数，非字符串值将被转换为字符串。

source: This function connects to GXC and creates a game instance of the specified size.
zh_cn: 此函数连接到GXC并创建一个指定大小的游戏实例。

source: This function controls the alpha (transparency) of the background sprite.
zh_cn: 此函数控制背景精灵的alpha(透明度)。

source: This function controls the alpha (transparency) of the sprite on the asset layer.
zh_cn: 此函数控制资源层精灵的alpha(透明度)。

source: This function controls the blending (or "tinting") of the background sprite and the default value is -1 (which represents the constant c_white, which can also be used).
zh_cn: 此函数控制背景精灵的混合(或"着色")，默认值为-1(表示常量c_white，也可以使用)。

source: This function controls the blending (or "tinting") of the sprite sprite and the default value is -1 (which represents the constant c_white, which can also be used).
zh_cn: 此函数控制精灵的混合(或"着色")，默认值是-1(代表常量c_white，也可以使用)。

source: This function controls the position along the x-axis of the room of the asset sprite element on the layer.
zh_cn: 此函数控制资源精灵元素在图层上房间的x轴位置。

source: This function controls the position along the x-axis of the room of the asset tile map element on the layer.
zh_cn: 此函数控制层上资源单幅图块地图元素沿房间x轴的位置。

source: This function controls the position along the y-axis of the room of the asset sprite element on the layer.
zh_cn: 此函数控制资源精灵元素在图层上房间的y轴位置。

source: This function controls the position along the y-axis of the room of the asset tile map element on the layer.
zh_cn: 此函数控制层上资源单幅图块地图元素沿房间y轴的位置。

source: This function controls whether GameMaker should update the particle system automatically or not, and normally you would not need to use this function as the default value of true (automatic update is on) is what you wish to happen.
zh_cn: 此函数控制 GameMaker 是否应该自动更新粒子系统，通常您不需要使用此函数，因为默认值 true（自动更新开启）是您希望发生的。

source: This function creates a new audio emitter and returns the index for it.
zh_cn: 此函数创建一个新的音频发射器并返回它的索引。

source: This function creates a pop-up message box which displays the given string and a button marked "Ok" to close it.
zh_cn: 此函数创建一个弹出消息框，显示给定的字符串和一个标有"Ok"的按钮来关闭它。

source: This function creates a pop-up message box with two buttons for "Yes" and "No".
zh_cn: 此函数创建一个带有"Yes"和"No"两个按钮的弹出消息框。

source: This function creates and returns a new audio bus struct, which can be modified to configure the bus' properties and to add audio effects to it.
zh_cn: 此函数创建并返回一个新的音频总线结构，可以修改这个结构来配置总线的属性并添加音频效果。

source: This function creates and returns a new audio effect struct, which can be modified to configure the effect's properties.
zh_cn: 此函数创建并返回一个新的音频效果结构，可以修改该结构来配置效果的属性。

source: This function defines a "chain" fixture shape.
zh_cn: 此函数定义了一个"链式"夹具形状。

source: This function defines a box shape for your fixture.
zh_cn: 此函数为您的夹具定义了一个盒子形状。

source: This function defines a circle shape for your fixture with a radius defined by the argument "rad".
zh_cn: 此函数为夹具定义一个圆形，其半径由参数"rad"定义。

source: This function defines an "edge" fixture shape.
zh_cn: 此函数定义了一个"边缘"夹具形状。

source: This function defines the input to be used by the rollback system.
zh_cn: 此函数定义了回滚系统要使用的输入。

source: This function defines the mocked input to be used by the rollback system during sync test.
zh_cn: 此函数定义了回滚系统在同步测试期间使用的模拟输入。

source: This function defines the object to use for players in rollback multiplayer.
zh_cn: 此函数定义了回滚多人游戏中玩家使用的对象。

source: This function defines the points of a polygon which has previously been set to the fixture using either physics_fixture_set_polygon_shape() or it can be used to add points to a chain of edge fixtures using the function physics_fixture_set_chain_shape().
zh_cn: 此函数定义了先前使用physics_fixture_set_polygon_shape()设置为夹具的多边形的点，也可以使用physics_fixture_set_chain_shape()函数将点添加到边缘夹具链中。

source: This function defines the position of a textured vertex for a primitive.
zh_cn: 此函数定义了图元的纹理顶点的位置。

source: This function defines the position of a vertex for a primitive, with its own colour and alpha setting.
zh_cn: 此函数定义了一个图元顶点的位置，有自己的颜色和alpha设置。

source: This function defines the position of a vertex for a primitive.
zh_cn: 此函数定义了图元顶点的位置。

source: This function destroys a custom attachment previously created using the skeleton_attachment_create() or skeleton_attachment_replace() functions.
zh_cn: 此函数销毁先前使用skeleton_attachment_create()或skeleton_attachment_replace()函数创建的自定义附件。

source: This function determines whether a string begins with the characters of a specified string, returning true or false as appropriate.
zh_cn: 此函数确定字符串是否以指定字符串的字符开头，并根据需要返回true或false。

source: This function determines whether a string ends with the characters of a specified string, returning true or false as appropriate.
zh_cn: 此函数确定字符串是否以指定字符串的字符结束，并根据需要返回true或false。

source: This function disables the automatic depth buffer generation for all surfaces that are created after it has been disabled.
zh_cn: 此函数禁用在禁用后创建的所有表面的自动深度缓冲区生成。

source: This function does exactly the same as the draw_sprite_stretched() function with the added ability to set the colour blending and alpha value for the sprite when it is drawn (similar to the function draw_sprite_ext()).
zh_cn: 此函数与 draw_sprite_stretched() 函数完全相同，并增加了在绘制精灵时为精灵设置颜色混合和 alpha 值的功能（类似于函数 draw_sprite_ext()）。

source: This function does exactly the same as the draw_surface_stretched() function with the added ability to set the colour blending and alpha value for the surface when it is drawn (similar to the function draw_surface_ext()).
zh_cn: 此函数的功能与draw_surface_stretched()函数完全相同，只是增加了在绘制表面时设置颜色混合和alpha值的功能(类似于draw_surface_ext())。

source: This function does just that.
zh_cn: 此函数就是这样做的。

source: This function draws the given sprite and sub-image at a position within the game room.
zh_cn: 此函数在游戏房间内的某个位置绘制给定的精灵和子图像。

source: This function draws the sprite assigned to the instance exactly as it would be drawn if the draw event held no code or actions, and will reflect and changes that have been made to the sprite variables in other events.
zh_cn: 此函数绘制分配给实例的精灵，就像绘制事件不包含任何代码或动作时所绘制的一样，并将反映和更改其他事件中对精灵变量所做的更改。

source: This function enables manual start, meaning that the game will not automatically start once everyone is connected and instead wait for rollback_start_game to be called.
zh_cn: 此函数支持手动启动，这意味着一旦所有人都连接上了，游戏就不会自动启动，而是等待rollback_start_game被调用。

source: This function enables you to map "touches" of a screen area to keyboard events.
zh_cn: 此函数使您能够将屏幕区域的"触摸"映射到键盘事件。

source: This function finishes the definition of a buffer save group.
zh_cn: 此函数完成了缓冲存储组的定义。

source: This function forces all layers to be drawn at the specified z depth.
zh_cn: 此函数强制在指定的z深度绘制所有层。

source: This function frees the memory associated with the dll or dylib with the given name.
zh_cn: 此函数释放与给定名称的dll或dylib相关的内存。

source: This function generates a custom debug event that will be shown in the Graph View of the debugger when a game is being run in Debug Mode.
zh_cn: 当游戏在调试模式下运行时，此函数生成一个自定义的调试事件，该事件将显示在调试器的图形视图中。

source: This function generates an array of strings as the "callstack" where the current script is listed first, and then all the other scripts that were run in order for the current script to be executed.
zh_cn: 此函数生成一个字符串数组作为"callstack ",其中首先列出当前脚本，然后是为了执行当前脚本而运行的所有其他脚本。

source: This function has no effect on any other device.
zh_cn: 此函数对任何其他设备都没有影响。

source: This function is a combination of the base draw_text() function with the draw_text_ext() and draw_text_colour() functions, permitting you to define gradient colours for text as well as the line spacing and maximum width per line all together.
zh_cn: 此函数是基本的draw_text()函数与draw_text_ext()和draw_text_colour()函数的组合，允许你定义文本的渐变颜色以及行间距和每行的最大宽度。

source: This function is a combination of the base draw_text() function with the draw_text_ext() and draw_text_transformed() functions, permitting you to scale and rotate text while maintaining a specific line spacing and maximum width per line.
zh_cn: 此函数是基础draw_text()函数与draw_text_ext()和draw_text_transformed()函数的组合，允许您缩放和旋转文本，同时保持特定的行距和每行的最大宽度。

source: This function is a combination of the base draw_text() function with the draw_text_ext(), draw_text_transformed() and draw_text_colour() functions.
zh_cn: 此函数是基本draw_text()函数与draw_text_ext()、draw_text_transformed()和draw_text_colour()函数的组合。
